# -*- mode: org; fill-column: 78; -*-
# Time-stamp: <2025-03-04 17:10:23 krylon>
#
#+TAGS: internals(i) bug(b) feature(f)
#+TAGS: design(d), meditation(m)
#+TAGS: optimize(o) refactor(r) cleanup(c)
#+TAGS: grammar(g) objects(o) interpreter(p)
#+TODO: TODO(t)  RESEARCH(r) IMPLEMENT(i) TEST(e) | DONE(d) FAILED(f) CANCELLED(c)
#+TODO: MEDITATE(m) PLANNING(p) | SUSPENDED(s)
#+PRIORITIES: A G D

* Epikur [0/0]
  :PROPERTIES:
  :COOKIE_DATA: todo recursive
  :VISIBILITY: children
  :END:
  A naive attempt at creating a primitive programming language.
** Clocktable
   #+BEGIN: clocktable :scope file :maxlevel 202 :emphasize t
   #+CAPTION: Clock summary at [2025-03-04 Di 17:10]
   | Headline               | Time   |        |      |
   |------------------------+--------+--------+------|
   | *Total time*           | *5:01* |        |      |
   |------------------------+--------+--------+------|
   | *Epikur [0/0]*         | *5:01* |        |      |
   | \_  /Components [0/0]/ |        | /5:01/ |      |
   | \_    Grammar [0/0]    |        |        | 5:01 |
   #+END:
** Features [0/0]
   :PROPERTIES:
   :COOKIE_DATA: todo recursive
   :VISIBILITY: children
   :END:
** Components [0/0]
   :PROPERTIES:
   :COOKIE_DATA: todo recursive
   :VISIBILITY: children
   :END:
*** Grammar [0/0]
    :PROPERTIES:
    :COOKIE_DATA: todo recursive
    :VISIBILITY: children
    :END:
    :LOGBOOK:
    CLOCK: [2025-03-04 Di 16:20]--[2025-03-04 Di 17:10] =>  0:50
    CLOCK: [2025-03-04 Di 14:40]--[2025-03-04 Di 15:50] =>  1:10
    CLOCK: [2025-03-03 Mo 17:57]--[2025-03-03 Mo 20:58] =>  3:01
    :END:
** Bugs [0/0]
   :PROPERTIES:
   :COOKIE_DATA: todo recursive
   :VISIBILITY: children
   :END:
